Repository: CoMatu/turbostat_tdd
Catalog: res/values/strings_*.arb
Languages: ru

# button_cancel
source: CANCEL
ru: ОТМЕНА

# button_delete
source: DELETE
ru: УДАЛИТЬ

# button_save
source: SAVE
ru: СОХРАНИТЬ

# car_card_alert_dialog_title
source: Remove a car from the list?
ru: Удалить автомобиль из списка?

# car_card_content_text
source: You will remove the car from the list of vehicles without the possibility of recovery
ru: Вы удалите автомобиль из списка транспортных средств без возможности восстановления

# car_card_no_image_selected
source: No image selected
ru: Изображение не выбрано

# car_card_mileage
source: Mileage: $mileage km
ru: Пробег: $mileage км

# car_card_enter_current_mileage
source: Enter current mileage
ru: Введите текущий пробег

# car_card_change
source: Edit
ru: Изменить

# drawer_not_logged
source: Not logged in
ru: Вход не выполнен

# drawer_my_cars
source: My cars
ru: Мои автомобили

# drawer_add_car
source: Add car
ru: Добавить автомобиль

# drawer_logout
source: Logout
ru: Выход из аккаунта

# form_warning_fill_info
source: Fill in the required information
ru: Заполните необходимую информацию

# form_alert_details
source: Details
ru: Детали

# form_alert_car_name
source: Car name: $name
ru: Имя: $name

# form_alert_car_mark
source: Car mark: $mark
ru: Марка: $mark

# form_alert_car_model
source: Car model: $model
ru: Модель: $model

# form_alert_car_year
source: Car year: $year
ru: Год выпуска: $year

# form_alert_car_mileage
source: Mileage: $mileage
ru: Пробег: $mileage

# form_initial_my_car
source: My Car
ru: Моя машина

# form_switch_replacement
source: Replacement
ru: Замена

# form_switch_check
source: Check
ru: Проверка

# form_validator_car_name
source: Please, enter a car name
ru: Пожалуйста, введите название

# form_validator_car_mark
source: Please, enter a car mark
ru: Пожалуйста, введите марку автомобиля

# form_validator_car_model
source: Please, enter a car model
ru: Пожалуйста, введите модель авто

# form_validator_car_year
source: Please, enter a car year
ru: Пожалуйста, введите год выпуска

# form_validator_car_mileage
source: Please, enter a current mileage
ru: Пожалуйста, введите текущий пробег

# form_validator_car_vin
source: Please, enter a VIN code
ru: Пожалуйста, введите VIN

# form_decorator_car_name
source: Choose a car name
ru: Придумайте название авто

# form_decorator_car_mark
source: Enter a car mark
ru: Введите марку автомобиля

# form_decorator_car_model
source: Enter a car model
ru: Введите модель автомобиля

# form_decorator_car_year
source: Enter a car year
ru: Введите год выпуска

# form_decorator_car_mileage
source: Enter a current mileage
ru: Введите текущий пробег

# form_decorator_car_vin
source: Enter a VIN code
ru: Введите VIN

# add_car_page_description
source: On this page you must enter information about your car:
ru: На этой странице необходимо ввести информацию о Вашем автомобиле:

# snack_bar_message_warning
source: The form is filled incorrectly! Correct the mistakes
ru: Форма заполнена некорректно! Исправьте ошибки...

# form_decorator_maintenance_interval
source: Maintenance interval, mo
ru: Периодичность, мес

# form_decorator_maintenance_interval_km
source: Maintenance interval, km
ru: Периодичность, км

# form_decorator_maintenance_name
source: Maintenance title
ru: Название проверки или вида ТО

# add_entry_page_description
source: On this page you must enter the name of the inspection or operation of the vehicle maintenance schedule, as well as the maintenance interval.
ru: На этой странице необходимо ввести название проверки или операции регламента технического обслуживания автомобиля, а также периодичность проверки.

# form_decorator_notes
source: Notes
ru: Заметки

# form_decorator_value_work
source: Value of work
ru: Стоимость работ

# form_decorator_value_parts
source: Value of parts
ru: Стоимость запчастей

# form_validator_dot
source: Use dot for groups of digits
ru: Используйте точку для групп разрядов

# form_decorator_part_name
source: Consumables / parts
ru: Расходные материалы / запчасти

# form_decorator_odometer_value
source: Odometer value, km
ru: Текущий пробег, км

# form_decorator_date_select
source: Select the date
ru: Выберите дату

# form_validator_date_format
source: Wrong date format
ru: Неправильный формат даты

# form_decorator_date
source: Maintenance date
ru: Дата проверки (операции)

# form_decorator_select_maintenance
source: Select maintenance from list
ru: Выберите проверку из списка

# add_operation_page_description
source: On this page, it is necessary to record the performed inspection or maintenance operation, odometer value, used consumables or spare parts
ru: На этой странице необходимо записать выполненную проверку или операцию ТО, показания одометра, использованные расходники или запчасти

# button_add_car
source: ADD CAR
ru: ДОБАВИТЬ АВТО

# car_list_page_warning
source: To get started you need to add a car
ru: Для начала работы с программой нужно добавить хотя бы один автомобиль

# dashboard_page_welcome
source: Welcome to TurboStat!
ru: Добро пожаловать в TurboStat!

# dashboard_page_not_determinate_title
source: No maintenance information
ru: Нет информации о проведении ТО

# dashboard_page_missed_maintenance
source: You missed a maintenance operation, your mileage was over $mileageFromLast km
ru: Вы пропустили операцию ТО, пробег сверх нормы составил $mileageFromLast км

# dashboard_page_missed_maintenance_days
source: You missed a maintenance operation for $daysOver days
ru: Вы пропустили операцию ТО на $daysOver дней

# dashboard_page_maintenance_before
source: $daysRemain days or $mileageRemain km left before the next maintenance operation
ru: До следующей операции ТО осталось $daysRemain дней или $mileageRemain км

# add_maintenance_regular
source: Add regular maintenance
ru: Добавить регламент ТО

# add_maintenance_operation
source: Write maintenance operation
ru: Записать операцию ТО

# edit_car_page_title
source: Edit car details:
ru: Редактировать информацию об автомобиле:

source: Delete image
ru: Удалить фотографию

# new_image_info
source: * a new image can be selected on the list of your cars page
ru: * новую фотографию можно выбрать на странице списка Ваших машин

source: Image deleted
ru: Фотография удалена

# edit_entry_page_title
source: Edit maintenance information
ru: Редактировать информацию вида технического обслуживания:

# button_edit
source: EDIT
ru: ИЗМЕНИТЬ

source: Works:
ru: Работа:

source: odometer
ru: пробег

source: Parts:
ru: Запчасти:

source: km
ru: км

source: date
ru: дата выполнения

# entry_details_page_description
source: This maintenance must be performed every $entryDateLimit2 months or $entryMileageLimit2 kilometers (whichever comes first)
ru: Эту операцию ТО необходимо выполнять каждые $entryDateLimit2 мес или $entryMileageLimit2 км (в зависимости от того, что наступит раньше)

source: Enter Email
ru: Введите Email

source: Enter Password
ru: Введите пароль

source: Password
ru: Пароль

# login
source: SIGN IN:
ru: ВХОД В ПРИЛОЖЕНИЕ:

source: SIGN IN
ru: ВХОД

source: SIGN IN WITH GOOGLE
ru: ВХОД ЧЕРЕЗ GOOGLE

# registration
source: Create an Account
ru: Зарегистрироваться

# already_have_account
source: Already have an account? Sign in
ru: Есть аккаунт? Войти

# delete_entry_operation
source: Delete record?
ru: Удалить запись?

# delete_entry_operation_warning
source: You will delete the current record without the possibility of recovery
ru: Вы удалите текущую запись без возможности восстановления

# button_edit_camel
source: Edit
ru: Изменить

# button_delete_camel
source: Delete
ru: Удалить

# button_add_calendar_camel
source: Remind
ru: Напомнить

# will_pop_alert
source: Exit the App?
ru: Выйти из приложения?

source: Pick Image
ru: Выбрать изображение

source: Statistics
ru: Статистика
